# SetGISLayer

## Description
Set layer context.

```pascal
FUNCTION SetGISLayer(hLayer : HANDLE) : BOOLEAN;
```

```python

def vs.SetGISLayer(hLayer):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hLayer|HANDLE||

## Version
Availability: from Vectorworks 2012
## Category
* GIS